{
  "site": "https://interviewing.io/blog",
  "items": [
    {
      "title": "Python Interview with a Microsoft engineer.",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nPython Interview with a Microsoft engineer\n==========================================\n\n#### Watch someone solve the reverse nodes in k-group problem in an interview with a Microsoft engineer and see the feedback their interviewer left them. Explore this problem and others in our library of interview replays.\n\n### Interview Summary\n\nProblem type\n\nReverse Nodes in k-Group\n\nInterview question\n\nGiven the head of a linked list, reverse the nodes of the list k at a time, and return the modified list.\nk is a positive integer and is less than or equal to the length of the linked list. If the number of nodes is not a multiple of k then left-out nodes, in the end, should remain as it is.\nYou may not alter the values in the list's nodes, only nodes themselves may be changed.\nInput: head = [[1,2],[3,4],[5...], k = 2\nOutput: [2,1,4,3,5]\nInput: head = [1,2,3,4,5], k = 3\nOutput: [3,2,1,4,5]\nInput: head [1,2,3,4,5,6,7,8] k = 3\nOutput: [[3,2,1],[6,5,4],7,8]\n\nRead more about the questions\n\n* [Reverse Nodes in k-Group](/questions/reverse-nodes-in-k-group)\n\n### Interview Feedback\n\nFeedback about Green Wolf (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs down](/static/images/recordings/thumbs_down.svg)No\n\nHow were their technical skills?\n\n3/4\n\nHow was their problem solving ability?\n\n2/4\n\nWhat about their communication ability?\n\n4/4\n\n> Probing question\n> ```\n> Given the head of a linked list, reverse the nodes of the list k at a time, and return the modified list.\n> k is a positive integer and is less than or equal to the length of the linked list. If the number of nodes is not a multiple of k then left-out nodes, in the end, should remain as it is.\n> You may not alter the values in the list's nodes, only nodes themselves may be changed.\n> Input: head = [1,2,3,4,5], k = 2\n> Output: [2,1,4,3,5]\n> Input: head = [1,2,3,4,5], k = 3\n> Output: [3,2,1,4,5]\n> ```\n> ### Strengths\n> - Overall very strong communication., clear and easy to follow.\n> - Took time to break down the problem. Seemed a bit stumped by what the question was asking\n> - Quick tip on this, it is always okay to ask the interviewer for more examples, or a run through. This is usually my go to approach to get interviewers to explain confusing or super long prompts.\n> - Overall good job with the run through. It was clear you understand the request.\n> - Communicated thought processes as they code which is beneficial.\n> - Clearly understands complexity analysis. Good job on this, a bit of speed would certain help still, but overall it was good to see that you understand what it all entails.\n> ### Points of Improvement\n> - With practice, patterns associated with questions become more apparent which can speed up how fast we start coding. In terms of a breakdown, you can aim to start coding after at most 7 mins or so.\n> - When the input format is not specified, try and leverage a structure that may be more friendly for you. An example, a list might actually be easier to work with. You may n\n> - I love the depth of planning but this can end up consuming a lot more time than you want. Aim to combine a mix of verbal and written communication to run through proposals as fast as possible before delving in. My go to approach has always been ideating and doing complexity analysis verbaly, only noting the solution steps and final complexity. This ensures I can ramble on if need be until a solution sticks, while not documenting this ideation process since thats when you make a lot of mistakes. Also make a point to engage your interviewe in this phase, get as much info from them at this stage as possible. You can get away with a lot.\n> - Gave a minor hint to a less optimal approach that builds on the same idea, using an aux space. Quick tip here, optimal solutions can sometimes be harder to code. If you have a sense of the less optimal approach, feel free to code it but mention that you are aware of an optimization that you can leverage down the line.\n> Software Engineer Study Guide\n> https://docs.google.com/spreadsheets/d/19vhVZ18LAvZTtKWn-cuJzto3AMpJ1npYK4vDWppDnrQ/edit?usp=sharing\n> Coding Interviews starter questions\n> # Starter Questions\n> This list here is not exhaustive. Use it more as a source of patterns. The Blind75 or Neetcode 150 list may also be worth a look but they are not broken down by pattern:\n> Blind75: https://www.techinterviewhandbook.org/best-practice-questions/\n> Neetcode 150: https://neetcode.io/practice\n> ## Pattern 1: Arrays\n> Here are some additional examples for the array pattern:\n> 1. Search in Rotated Sorted Array - Difficulty: Medium, Estimated Time: 45 min\n> 2. Jump Game - Difficulty: Medium, Estimated Time: 40 min\n> 3. Merge Intervals - Difficulty: Medium, Estimated Time: 35 min\n> ## Pattern 2: Linked Lists\n> 1. Reverse Linked List - Difficulty: Easy, Estimated Time: 25 min - [Link](https://leetcode.com/problems/reverse-linked-list/)\n> 2. Linked List Cycle - Difficulty: Easy, Estimated Time: 30 min - [Link](https://leetcode.com/problems/linked-list-cycle/)\n> 3. Merge Two Sorted Lists - Difficulty: Easy, Estimated Time: 35 min - [Link](https://leetcode.com/problems/merge-two-sorted-lists/)\n> 4. Palindrome Linked List - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/palindrome-linked-list/)\n> 5. Intersection of Two Linked Lists - Difficulty: Medium, Estimated Time: 45 min - [Link](https://leetcode.com/problems/intersection-of-two-linked-lists/)\n> ## Pattern 3: Strings\n> Here are some additional examples to replace the easy ones with more challenging ones:\n> 1. Reverse Words in a String - Difficulty: Medium, Estimated Time: 30 min - [Link](https://leetcode.com/problems/reverse-words-in-a-string/)\n> 2. Group Shifted Strings - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/group-shifted-strings/)\n> 3. Longest Substring with At Least K Repeating Characters - Difficulty: Medium, Estimated Time: 50 min - [Link](https://leetcode.com/problems/longest-substring-with-at-least-k-repeating-characters/)\n> 4. String Compression - Difficulty: Medium, Estimated Time: 30 min - [Link](https://leetcode.com/problems/string-compression/)\n> 5. Palindromic Substrings - Difficulty: Medium, Estimated Time: 50 min - [Link](https://leetcode.com/problems/palindromic-substrings/)\n> ## Pattern 4: Trees\n> 1. Path Sum III - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/path-sum-iii/)\n> 2. Construct Binary Tree from Preorder and Inorder Traversal - Difficulty: Medium, Estimated Time: 45 min - [Link](https://leetcode.com/problems/construct-binary-tree-from-preorder-and-inorder-traversal/)\n> 3. Binary Tree Zigzag Level Order Traversal - Difficulty: Medium, Estimated Time: 50 min - [Link](https://leetcode.com/problems/binary-tree-zigzag-level-order-traversal/)\n> 4. Subtree of Another Tree - Difficulty: Easy, Estimated Time: 30 min - [Link](https://leetcode.com/problems/subtree-of-another-tree/)\n> 5. Diameter of Binary Tree - Difficulty: Easy, Estimated Time: 30 min - [Link](https://leetcode.com/problems/diameter-of-binary-tree/)\n> ## Pattern 5: Dynamic Programming\n> 1. Longest Palindromic Substring - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/longest-palindromic-substring/)\n> 2. Maximum Subarray - Difficulty: Easy, Estimated Time: 30 min - [Link](https://leetcode.com/problems/maximum-subarray/)\n> 3. House Robber II - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/house-robber-ii/)\n> 4. Counting Bits - Difficulty: Medium, Estimated Time: 35 min - [Link](https://leetcode.com/problems/counting-bits/)\n> 5. Longest Increasing Path in a Matrix - Difficulty: Hard, Estimated Time: 90 min - [Link](https://leetcode.com/problems/longest-increasing-path-in-a-matrix/)\n> ## Pattern 6: Hash Tables\n> 1. Top K Frequent Elements - Difficulty: Medium, Estimated Time: 35 min - [Link](https://leetcode.com/problems/top-k-frequent-elements/)\n> 2. Intersection of Two Arrays II - Difficulty: Easy, Estimated Time: 25 min - [Link](https://leetcode.com/problems/intersection-of-two-arrays-ii/)\n> 3. Longest Substring with At Most Two Distinct Characters - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/longest-substring-with-at-most-two-distinct-characters/)\n> 4. Minimum Window Substring - Difficulty: Hard, Estimated Time: 90 min - [Link](https://leetcode.com/problems/minimum-window-substring/)\n> 5. Group Anagrams - Difficulty: Medium, Estimated Time: 35 min - [Link](https://leetcode.com/problems/group-anagrams/)\n> ## Pattern 7: Binary Search\n> 1. Find Peak Element - Difficulty: Medium, Estimated Time: 35 min - [Link](https://leetcode.com/problems/find-peak-element/)\n> 2. Search a 2D Matrix - Difficulty: Medium, Estimated Time: 30 min - [Link](https://leetcode.com/problems/search-a-2d-matrix/)\n> 3. Kth Smallest Element in a Sorted Matrix - Difficulty: Medium, Estimated Time: 45 min - [Link](https://leetcode.com/problems/kth-smallest-element-in-a-sorted-matrix/)\n> 4. Search in a Sorted Array of Unknown Size - Difficulty: Medium, Estimated Time: 45 min - [Link](https://leetcode.com/problems/search-in-a-sorted-array-of-unknown-size/)\n> 5. Median of Two Sorted Arrays - Difficulty: Hard, Estimated Time: 90 min - [Link](https://leetcode.com/problems/median-of-two-sorted-arrays/)\n> ## Pattern 8: Graphs\n> 1. Minimum Knight Moves - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/minimum-knight-moves/)\n> 2. Cheapest Flights Within K Stops - Difficulty: Medium, Estimated Time: 50 min - [Link](https://leetcode.com/problems/cheapest-flights-within-k-stops/)\n> 3. Course Schedule - Difficulty: Medium, Estimated Time: 45 min - [Link](https://leetcode.com/problems/course-schedule/)\n> 4. Number of Connected Components in an Undirected Graph - Difficulty: Medium, Estimated Time: 35 min - [Link](https://leetcode.com/problems/number-of-connected-components-in-an-undirected-graph/)\n> 5. Word Ladder - Difficulty: Medium, Estimated Time: 50 min - [Link](https://leetcode.com/problems/word-ladder/)\n> ## Backtracking\n> 1. Letter Combinations of a Phone Number - Difficulty: Medium, Estimated Time: 35 min\n> 2. Subsets - Difficulty: Medium, Estimated Time: 35 min\n> 3. Permutations - Difficulty: Medium, Estimated Time: 40 min\n> 4. Combination Sum - Difficulty: Medium, Estimated Time: 50 min\n> 5. Word Search - Difficulty: Medium, Estimated Time: 45 min\n> ## Depth First Search (DFS)\n> 1. Number of Islands - Difficulty: Medium, Estimated Time: 40 min\n> 2. Surrounded Regions - Difficulty: Medium, Estimated Time: 45 min\n> 3. Max Area of Island - Difficulty: Medium, Estimated Time: 45 min\n> 4. Pacific Atlantic Water Flow - Difficulty: Medium, Estimated Time: 50 min\n> 5. All Paths From Source to Target - Difficulty: Medium, Estimated Time: 45 min\n> ## Breadth First Search (BFS)\n> 1. Surrounded Regions - Difficulty: Medium, Estimated Time: 45 min\n> 2. Clone Graph - Difficulty: Medium, Estimated Time: 40 min\n> 3. Shortest Path in a Binary Matrix - Difficulty: Medium, Estimated Time: 50 min\n> 4. Walls and Gates - Difficulty: Medium, Estimated Time: 45 min\n> 5. Course Schedule II - Difficulty: Medium, Estimated Time: 45 min\n> ## Greedy Algorithms\n> 1. Jump Game II - Difficulty: Hard, Estimated Time: 90 min\n> 2. Best Time to Buy and Sell Stock II - Difficulty: Easy, Estimated Time: 25 min\n> 3. Task Scheduler - Difficulty: Medium, Estimated Time: 50 min\n> 4. Minimum Number of Arrows to Burst Balloons - Difficulty: Medium, Estimated Time: 45 min\n> 5. Jump Game - Difficulty: Medium, Estimated Time: 40 min\n> ### Recursion\n> 1. Fibonacci Number - Difficulty: Easy, Estimated Time: 20 min - [Link](https://leetcode.com/problems/fibonacci-number/)\n> 2. Climbing Stairs - Difficulty: Easy, Estimated Time: 20 min - [Link](https://leetcode.com/problems/climbing-stairs/)\n> 3. Binary Tree Maximum Path Sum - Difficulty: Hard, Estimated Time: 90 min - [Link](https://leetcode.com/problems/binary-tree-maximum-path-sum/)\n> 4. Unique Paths III - Difficulty: Hard, Estimated Time: 60 min - [Link](https://leetcode.com/problems/unique-paths-iii/)\n> 5. Combination Sum III - Difficulty: Medium, Estimated Time: 35 min - [Link](https://leetcode.com/problems/combination-sum-iii/)\n> ### Dynamic Programming\n> 1. Longest Increasing Subsequence - Difficulty: Medium, Estimated Time: 45 min - [Link](https://leetcode.com/problems/longest-increasing-subsequence/)\n> 2. Unique Paths - Difficulty: Medium, Estimated Time: 30 min - [Link](https://leetcode.com/problems/unique-paths/)\n> 3. Coin Change - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/coin-change/)\n> 4. Best Time to Buy and Sell Stock - Difficulty: Easy, Estimated Time: 25 min - [Link](https://leetcode.com/problems/best-time-to-buy-and-sell-stock/)\n> 5. Word Break - Difficulty: Medium, Estimated Time: 40 min - [Link](https://leetcode.com/problems/word-break/)\n> For communication, here are some example filler statements to use to bring interviewers into the convo while timeboxing yourself:\n> Example filler phrases:\n> 1. \"Am I going in the right direction with this?\"\n> 2. \"Is this the kind of solution you had in mind?\"\n> 3. \"Would you like me to go deeper into this aspect?\"\n> 4. \"Do you have any preferences on how I should proceed?\"\n> 5. “Does this make sense to you?”\n> Timeboxing strategy\n> 1. \\*\\*Set a Mental Timer\\*\\*: Before answering, set an internal goal for how long your response should be, like 1-2 minutes, and try to stick to it.\n> 1. This can involve limiting your scope to just the problem/ Solution\n> 2. \\*\\*Structure Your Answers\\*\\*: Use frameworks like the STAR method (Situation, Task, Action, Result) to structure your answers. This provides a beginning, middle, and end to your responses.\n> 3. \\*\\*Practice with a Timer\\*\\*: Before the interview, practice answering common questions using a timer to get a feel for how long 1-2 minutes is.\n> 1. May not be viable in an interview, but do this with async practice. It comes in handy to built that communication muscle\n> 4. \\*\\*Bullet Points\\*\\*: Mentally outline 2-3 main points you want to cover in your answer and stick to them.\n> 1. Scoping your thoughts again to avoid rabbit holes.\n> 5. \\*\\*Pause for Feedback\\*\\*: After making a point, pause briefly to see if the interviewer is indicating (verbally or non-verbally) that they'd like more detail or if they're satisfied with your answer.\n> 1. Do this often! It really makes interviews natural and forces you to practice brevity.\n> 6. \\*\\*Open-Ended Closure\\*\\*: End your answer with a phrase like, \"Does that answer your question?\" or \"Would you like me to go into more detail on any point?\" This gives the interviewer a chance to guide the conversation if they want more information.\n> 1. See the filler list above. You can use one, you can use many, judge by context.\n> 7. \\*\\*Limit Examples\\*\\*: While real-world examples are valuable, avoid giving multiple examples for a single point unless asked.\n> 1. 2-3 at most, 1 good one is usually enough.\n> 8. \\*\\*Practice Brevity\\*\\*: Regularly practice answering questions in a concise manner, even in everyday conversations, to build the habit.\n> 1. STAR can help here. You can also use breath count or sentence count here. I usually try to keep things within 2 breaths before bringing the interviewer in, with a pause between each breath.\n> 9. \\*\\*Deep Breaths\\*\\*: Never communicate yourself out of breath, make this a heuristic. Take a deep breath, then communicate for 1 or two cycles.\n> 10. \\*\\*Summarize\\*\\*: If you find you've been speaking for a while, wrap up with a brief summary of your main points to bring closure to your answer.\n> 1. Do a quick recap after particularly long points, or once you are done with a probing type of conversation. Use these as chances to also document.\n> 11. \\*\\*Pre-prepare Answers\\*\\*: Anticipate common interview questions and prepare concise answers in advance. This reduces the chance of rambling as you're not constructing your answer on the fly.\n> 1. We can discuss this further, but with system design especially, there is quite a lot that can be pre curated.\n\nFeedback about The Legendary Avenger (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n4/4\n\nHow good were the questions?\n\n4/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n4/4\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/microsoft-python-reverse-nodes-in-k-group"
    },
    {
      "title": "I love meritocracy, but all the recent anti-DEI rhetoric is bad",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nI love meritocracy, but all the recent anti-DEI rhetoric is bad\n===============================================================\n\nBy Aline Lerner | Published:\n\n#### Related posts\n\n[We looked at how a thousand college students performed in technical interviews to see if where they went to school mattered. It didn't.](/blog/we-looked-at-how-a-thousand-college-students-performed-in-technical-interviews-to-see-if-where-they-went-to-school-mattered-it-didnt)\n\n[Announcing the interviewing.io Technical Interview Practice Fellowship](/blog/announcing-the-interviewing-io-technical-interview-practice-fellowship)\n\n[Refuting Bloomberg's analysis: ChatGPT isn't racist. But it is bad at recruiting.](/blog/refuting-bloombergs-analysis-chatgpt-isnt-racist)\n\n[Lessons from a year’s worth of hiring data](/blog/lessons-from-a-years-worth-of-hiring-data)\n\n#### Stuff we write about\n\n[Recession](/blog/category/recession)[Salary negotiation](/blog/category/salary-negotiation)[Company News](/blog/category/company-news)[Data Deep Dives](/blog/category/data-deep-dives)[Diversity](/blog/category/diversity)[Guest Posts](/blog/category/guest-posts)[Hiring is broken](/blog/category/hiring-is-broken)[Interview tips](/blog/category/interview-tips)[For employers, how to hire better](/blog/category/for-employers-how-to-hire-better)\n\n### Have interviews coming up? Study up on common questions and topics.",
      "content_type": "blog",
      "source_url": "https://interviewing.io/blog/i-love-meritocracy-but-all-the-recent-anti-dei-rhetoric-is-bad#user-content-fnref-2"
    },
    {
      "title": "Regex Matching Interview Problem (Java)",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nJava Interview with a Google engineer\n=====================================\n\n#### Watch someone solve the regex matching problem in an interview with a Google engineer and see the feedback their interviewer left them. Explore this problem and others in our library of interview replays.\n\n### Interview Summary\n\nProblem type\n\nRegex matching\n\nInterview question\n\nGiven an input string (s) and a pattern (p), implement regular expression matching with support for '.' and '\\*'.\n'.' Matches any single character.\n'\\*' Matches zero or more of the preceding element.\nThe matching should cover the entire input string (not partial).\n\nRead more about the questions\n\n* [Regular Expression Matching](/questions/regular-expression-matching)\n\n### Interview Feedback\n\nFeedback about Cashmere Panda (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs down](/static/images/recordings/thumbs_down.svg)No\n\nHow were their technical skills?\n\n3/4\n\nHow was their problem solving ability?\n\n2/4\n\nWhat about their communication ability?\n\n3/4\n\n> One thing you did that was great was taking the time to step through examples by hand before running your code. As you noticed, this is a good way to find bugs in your proposed algorithm before you even start coding.\n> We talked quite a bit about what you could do better, but to summarize, I think doing well in interviews like this is 50% problem-solving skills and 50% having a mental \"library\" of problems you've seen before, and being able to pattern-match so you can apply what you know about a similar problem to one where a few of the details are new to you. The latter is easier to build with practice than the former -- the more practice problems you do, the more likely you are to already have seen a similar problem to the one you're being asked to solve in an interview.\n> That nebulous \"problem-solving skills\" piece has something to do with being willing to take a step back and rethink your strategy, as we talked about; also knowing how to recognize when a problem can be solved with recursion. Practice does help with this too: the more recursive algorithms you study, the more you'll notice when a problem can be broken up into smaller subproblems.\n> If you want to keep working on this problem on your own, you can compare your work against the solution here: https://leetcode.com/problems/regular-expression-matching/description/.\n> I thought your communication was good and you did a good job of explaining what you were thinking. This is a challenging question, and I know you said you were new to practice interviews, so don't be discouraged and keep practicing!\n\nFeedback about Paisley Wallaby (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n4/4\n\nHow good were the questions?\n\n4/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n4/4\n\n> 1/4\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/google-java-regex-matching"
    },
    {
      "title": "Facebook/Meta Interview (Python)",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nPython Interview with a Meta engineer\n=====================================\n\n#### Watch someone solve the xml parser problem in an interview with a Meta engineer and see the feedback their interviewer left them. Explore this problem and others in our library of interview replays.\n\n### Interview Summary\n\nProblem type\n\nXML parser\n\nInterview question\n\n1) Write an XML parser.\n2) Write an XML formatter.\n\nRead more about the questions\n\n* [XML Parser](/questions/xml-parser)\n\n### Interview Feedback\n\nFeedback about Warm Dingo (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow were their technical skills?\n\n2/4\n\nHow was their problem solving ability?\n\n3/4\n\nWhat about their communication ability?\n\n3/4\n\n> I gave you the feedback. Keep working on those and you should be good.\n\nFeedback about Mighty Jaguar (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n4/4\n\nHow good were the questions?\n\n4/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n4/4\n\n> Really good as it was not a copy-paste of a Leetcode type of problem. Which I would have jumped and blurted some quick code on it.\n> The question was not well-formed, which is what I actually expect while interviewing for a senior position. It was a collaborative experience as there were ideas exchanged in words much before actually got down to coding.\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/facebook-python-xml-parser"
    },
    {
      "title": "C# Interview with a Google engineer.",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nC# Interview with a Google engineer\n===================================\n\n#### Watch someone solve the maximum sum subarray problem in an interview with a Google engineer and see the feedback their interviewer left them. Explore this problem and others in our library of interview replays.\n\n### Interview Summary\n\nProblem type\n\nMaximum sum subarray\n\nInterview question\n\nGiven an array, give the start and end indices for a subarray that contains the maximum sum.\n\nRead more about the questions\n\n* [Maximum Subarray](/questions/maximum-subarray)\n\n### Interview Feedback\n\nFeedback about Awesome Llama (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow were their technical skills?\n\n3/4\n\nHow was their problem solving ability?\n\n4/4\n\nWhat about their communication ability?\n\n4/4\n\n> Mr Llama discivered Kadanes algorithm with minor hints and ended up with an almost clean solution.\n> Llama should try to write optimal solutions sooner in the interview to get to follow up questions.\n\nFeedback about Epic Iguana (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n1/4\n\nHow good were the questions?\n\n4/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n3/4\n\n> 1/4\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/google-csharp-maximum-sum-subarray"
    },
    {
      "title": "Python Interview with an Amazon Engineer (Boundary Traversal)",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nPython Interview with an Amazon engineer\n========================================\n\n#### Watch someone solve the boundary traversal binary tree problem in an interview with an Amazon engineer and see the feedback their interviewer left them. Explore this problem and others in our library of interview replays.\n\n### Interview Summary\n\nProblem type\n\nBoundary Traversal Binary Tree\n\nInterview question\n\nPrint the boundaries of a given tree.\n\nRead more about the questions\n\n* [Boundary of Binary Tree](/questions/boundary-of-binary-tree)\n\n### Interview Feedback\n\nFeedback about Dystopian Abacus (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow were their technical skills?\n\n4/4\n\nHow was their problem solving ability?\n\n4/4\n\nWhat about their communication ability?\n\n4/4\n\n> -Discuss couple of other approaches if you can think of them, their tradeoffs\n> -walkthrough an example after finishing coding, (which you did)\n> - volunteer to provide space and time complexity\n> - offer to write unit tests covering various edge cases\n\nFeedback about Rocket Samurai (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n3/4\n\nHow good were the questions?\n\n3/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n3/4\n\n> Would have liked a little more guidance in the first problem given that the problem description is a little vague but overall was great.\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/amazon-python-boundary-traversal-binary-tree"
    },
    {
      "title": "Python Interview with a FAANG Engineer (Reverse Nodes in k-Group)",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nReverse Nodes in k-Group\n========================\n\n#### Watch someone solve the reverse nodes in k-group problem in an interview with a FAANG engineer and see the feedback their interviewer left them. Explore this problem and others in our library of interview replays.\n\n### Interview Summary\n\nProblem type\n\nReverse Nodes in k-Group\n\nInterview question\n\nGiven the head of a linked list, reverse the nodes of the list k at a time, and return the modified list.\nk is a positive integer and is less than or equal to the length of the linked list. If the number of nodes is not a multiple of k then left-out nodes, in the end, should remain as it is.\nYou may not alter the values in the list's nodes, only nodes themselves may be changed.\n\nRead more about the questions\n\n* [Reverse Nodes in k-Group](/questions/reverse-nodes-in-k-group)\n\n### Interview Feedback\n\nFeedback about Swift Thunder (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow were their technical skills?\n\n4/4\n\nHow was their problem solving ability?\n\n4/4\n\nWhat about their communication ability?\n\n4/4\n\n> Strong pass - candidate crushed it, no major notes\n> Good talking through possible solutions and discussing tradeoffs\n> Asking questions and clarifications at start - good!\n> Discussing algorithm before coding - good!\n> Typing out example - good!\n> Good thinking about the edge case (e.g. not enough remaining nodes)\n> Good discussion of options for dealing with edge case\n> Good discussion of time complexity in tradeoffs\n> Pseudocode vs real code - i’m fine with real code, weigh time tradeoff\n> Good asking about boundaries of the input variables\n> Good use of functions\n> Creating stubs and filling out later - good technique!\n> Good bounds checking\n> One thing to keep in mind with recursive solutions: stack depth!\n> Consider using python types - good style and helps clarity\n> Not a bad idea to throw in a couple of comments\n> Can sometimes be good to run through examples on top of the actual code using comments\n> Walking through an example to “test” your code is a great practice, but don’t spend too much time vs \\*actual\\* testing\n> Good testing practice, don’t forget to test all edge cases\n\nFeedback about Existential Cronut (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n4/4\n\nHow good were the questions?\n\n4/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n4/4\n\n> I really enjoyed the interview, you did really well in giving me the right level of assistance to keep under the time constraints. It was also pretty useful that you had prepared some extra code for testing, not all interviews are like that. I don't really have an idea of how you could improve your interviews per say.\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/Reverse-Nodes-in-k-Group"
    },
    {
      "title": "Print Folder Structure (Python)",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nPrint Folder Structure Problem (Python)\n=======================================\n\n#### Watch someone print a folder structure using Python in a mock interview with a Google engineer. Explore this problem and others in the world's largest library of interview recordings.\n\n### Interview Summary\n\nProblem type\n\nPrint folder structure\n\nInterview question\n\nGiven a list of file paths, print all of the files in each of the folders.\n\nRead more about the questions\n\n* [Print Folder Structure](/questions/print-folder-structure)\n\n### Interview Feedback\n\nFeedback about Intrepid Broccoli (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs down](/static/images/recordings/thumbs_down.svg)No\n\nHow were their technical skills?\n\n4/4\n\nHow was their problem solving ability?\n\n3/4\n\nWhat about their communication ability?\n\n4/4\n\n> I gave feedback verbally to the interviewee at the end of the interview. To recap, the feedback was:\n> - Try to stay higher level before you jump in\n> - Think about optimizations before you code\n> - Code was very clean! Nice work. Clearly has great technical skills\n> - Don't feel like you need to explain the entire time unless you like thinking out loud\n> - Use small utility functions to save time. The interviewer likely won't ask you to implement if they are trivial, or at the very least won't dock marks if you run out of time without implementing.\n> - Conversely, don't use too many util functions where you start to run out of time\n> - Look for ways to simplify your solution\n> class FilesystemNode:\n> def \\_\\_init\\_\\_(self, name):\n> self.name = name # string\n> self.children = {} # {child1:.., child2:..}\n> def add\\_child\\_if\\_not\\_exists(self, child\\_name):\n> if child\\_name in self.children:\n> return None\n> children.put(child\\_name, FilesystemNode(name=child\\_name))\n> class Filesystem:\n> def \\_\\_init\\_\\_(self, files):\n> self.trie = \\_build\\_trie(files)\n> def pretty\\_print\\_dir\\_structure():\n> \\_pre\\_order\\_traversal(self.trie)\n> def \\_build\\_trie(files):\n> trie = FilesystemNode(name='/')\n> for file in files:\n> current\\_trie\\_node = trie\n> for file\\_path\\_element in file.split('/'):\n> new\\_child = current\\_trie\\_node.add\\_child\\_if\\_not\\_exists(file\\_path\\_element)\n> if new\\_child is not None:\n> current\\_trie\\_node = new\\_child\n> def \\_pre\\_order\\_traversal(trie, num\\_tabs=0):\n> for child in trie.children\n> print\\_with\\_tabs(child, num\\_tabs)\n> pre\\_order\\_traversal(child, num\\_tabs+1)\n\nFeedback about Astronomic Koala (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n4/4\n\nHow good were the questions?\n\n4/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n4/4\n\n> Best algs/data structures interviewer I've had! You listened well, and it showed in your feedback, because you made good inferences about my thinking style, and how to improve at the margin. Much appreciated!\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/google-python-print-folder-structure"
    },
    {
      "title": "Non-Decreasing Array (Python)",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nPython Interview with a Microsoft engineer\n==========================================\n\n#### Watch someone solve the non-decreasing array problem in an interview with a Microsoft engineer and see the feedback their interviewer left them. Explore this problem and others in our library of interview replays.\n\n### Interview Summary\n\nProblem type\n\nNon-decreasing Array\n\nInterview question\n\nGiven an array nums with n integers, your task is to check if it could become non-decreasing by modifying at most one element.\n\n### Interview Feedback\n\nFeedback about Winter Penguin (the interviewee)\n\nAdvance this person to the next round?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow were their technical skills?\n\n4/4\n\nHow was their problem solving ability?\n\n3/4\n\nWhat about their communication ability?\n\n4/4\n\n> 5 star on everything for L4, slight weaknesses for L5 but overall, great!\n> You're doing an amazing job, and Amazon would be lucky to have you. Goodluck in your interviews.\n> Feedback Non Decreasing Array\n> Targeting L5\n> -Expecting technical solution and overall good comm flow.\n> - Also expecting very deep complexity analysis.\n> Technical Feedback\n> - Immediately wrote wrapping function, good py3 syntax. ++ Fast\n> - Immediately jumped to code, might be beneficial to write pseudo and maybe proof check logic relative to examples. \\*\\*\n> - Consistent coding style , pep8\n> - Avoid navigating sliced copy of array, pointers guarantee access without slicing -\n> - Quick to code functional solution, able to run through fairly fast. ++ FAST\n> - Thought of bin search<- Won't be necessary given the search has to be linear and we will possibly have multiple values not following the pattern —\n> - Exploring use case for bin search- Can harm you if you contemplate the use of an algorithm you don't have a grip on. Great perf, but not seeing bin search as an invalid option might be a red flag - - [Passive negative]\n> - Able to think through bin search, caught up exposing weakness with it. [Bin search can perform on equal values in array, be mindful not to expose a weakness in this regard. Cover the fundamentals. [ - -]]\n> - Hint of splice [Able to figure out that splicing is O(n), optimized it fairly + Slow]\n> - Able to think through generalization case ++ Fast\n> [Testing on distributed computation]\n> - Evaluating use of either distributed computation or parallelization. [+ Slow, always jump to map reduce when the computation is huge]\n> - Excellent [Was able to catch the split point issue with distributed computation +++ Fast]\n> Communicative Feedback\n> - Has a thought first, code later approach which is organized ++ Excellent\n> - Is able to mix up speaking and typing, doesn’t. Able to keep up with much of the logic. ++\n> - Smooth communication style, confident. Never was confrontation when interrupted.\n\nFeedback about The Legendary Avenger (the interviewer)\n\nWould you want to work with this person?\n\n![Thumbs up](/static/images/recordings/thumbs_up.svg)Yes\n\nHow excited would you be to work with them?\n\n4/4\n\nHow good were the questions?\n\n3/4\n\nHow helpful was your interviewer in guiding you to the solution(s)?\n\n4/4\n\n> Really lovely session! I greatly enjoyed your feedback, it was very well structured and had good take-aways on areas of improvements and some of the subtler strategies to interviewing. My only suggestion (and take this with a big grain of salt!) is to perhaps ask questions that either focus on the more tricky points of arrays, or more complex data structures. Personal opinion, but general array questions tend to be the \"freebies\" in interview loops, versus the more challenging DS such as graphs, or trickier concepts such as backtracking/recursion in general. Again, take this feedback with a grain of salt! You have the interviewer experience, not me :)\n\n### Interview Transcript\n\n[See more interviews](/mocks)",
      "content_type": "other",
      "source_url": "https://interviewing.io/mocks/microsoft-python-non-decreasing-array"
    },
    {
      "title": "Are recruiters better than a coin flip at judging resumes? Here's the data.",
      "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\nAre recruiters better than a coin flip at judging resumes? Here's the data.\n===========================================================================\n\nBy Aline Lerner and Peter Bergman | Published:\n\n#### Related posts\n\n[Impostor syndrome strikes men just as hard as women... and other findings from thousands of technical interviews](/blog/impostor-syndrome-strikes-men-just-as-hard-as-women)\n\n[Refuting Bloomberg's analysis: ChatGPT isn't racist. But it is bad at recruiting.](/blog/refuting-bloombergs-analysis-chatgpt-isnt-racist)\n\n[Exactly what to say when recruiters ask you to name the first number… and other negotiation word-for-words](/blog/negotiate-salary-recruiter)\n\n[We looked at how a thousand college students performed in technical interviews to see if where they went to school mattered. It didn't.](/blog/we-looked-at-how-a-thousand-college-students-performed-in-technical-interviews-to-see-if-where-they-went-to-school-mattered-it-didnt)\n\n#### Stuff we write about\n\n[Recession](/blog/category/recession)[Salary negotiation](/blog/category/salary-negotiation)[Company News](/blog/category/company-news)[Data Deep Dives](/blog/category/data-deep-dives)[Diversity](/blog/category/diversity)[Guest Posts](/blog/category/guest-posts)[Hiring is broken](/blog/category/hiring-is-broken)[Interview tips](/blog/category/interview-tips)[For employers, how to hire better](/blog/category/for-employers-how-to-hire-better)\n\n### Have interviews coming up? Study up on common questions and topics.",
      "content_type": "blog",
      "source_url": "https://interviewing.io/blog/are-recruiters-better-than-a-coin-flip-at-judging-resumes"
    }
  ],
  "summary": {
    "total_items": 10,
    "total_errors": 0,
    "scraped_at": "2025-09-15 11:59:09"
  }
}